PRAK701/app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'Mags'
 LIMIT 1
---
    public function login()
    {
        helper(['form']);
        $request = \Config\Services::request();
        $session = session();
            if ($this->request->getPost() != null) {
                $rules = [
                'username' => 'required',
                'password' => 'required|min_length[3]|max_length[255]',
            ];

            if (!$this->validate($rules)) {
                return view('auth/login', [
                    'validation' => $this->validator,
                ]);
            } else {
                $model = new UserModel();
                $username = $this->request->getPost('username');
                $password = $this->request->getPost('password');

                $user = $model->where('username', $username)->first();