PRAK701/app/Controllers/Buku.php

    public function index()
{
    $session = session();
    if (! $session->get('logged_in')) {
        die('Belum login');
    } else {
        echo 'Sudah login sebagai: ' . $session->get('username');
    }

    $data['buku'] = $this->bukuModel->findAll();
---
SELECT *
FROM `buku`

            'tahun_terbit' => $this->request->getPost('tahun_terbit'),
        ];

        $this->bukuModel->insert($data);
---
INSERT INTO `buku` (`judul`, `penulis`, `penerbit`, `tahun_terbit`) VALUES ('Sumur', 'Eka Kurniawan', 'Penguin Books', '2020')

    public function edit($id)
    {
        $data['buku'] = $this->bukuModel->find($id);
---
SELECT *
FROM `buku`
WHERE `buku`.`id` = '3'

            'tahun_terbit' => $this->request->getPost('tahun_terbit'),
        ];

        $this->bukuModel->update($id, $data);
---
UPDATE `buku` SET `judul` = 'Sumur', `penulis` = 'Eka Kurniawan', `penerbit` = 'Penguin Books', `tahun_terbit` = '2011'
WHERE `buku`.`id` IN ('3')

    public function delete($id)
    {
        $this->bukuModel->delete($id);
---
DELETE FROM `buku`
WHERE `id` IN ('3')